'''
描述
min() 方法返回给定参数的最小值，参数可以为序列。

语法
以下是 min() 方法的语法:
min( x, y, z, .... )

参数
x -- 数值表达式。
y -- 数值表达式。
z -- 数值表达式。

返回值
返回给定参数的最小值。
'''

print ("min(80, 100, 1000) : ", min(80, 100, 1000))
print ("min(-20, 100, 400) : ", min(-20, 100, 400))
print ("min(-80, -20, -10) : ", min(-80, -20, -10))
print ("min(0, 100, -400) : ", min(0, 100, -400))

'''
输出结果
min(80, 100, 1000) :  80
min(-20, 100, 400) :  -20
min(-80, -20, -10) :  -80
min(0, 100, -400) :  -400
'''

#1.传入的多个参数的最小值
print(min(1,2,3,4))  #输出 1

#2.传入可迭代对象时，取其元素最小值
s='12345'
print(min(s))        #输出 1

#3.传入命名参数key，其为一个函数，用来指定取最小值的方法

s = [
    {'name': 'sumcet', 'age': 18},
    {'name': 'bbu', 'age': 11}
]
a = min(s, key=lambda x: x['age'])
print(a)        #输出 {'name': 'bbu', 'age': 11}